// VARIABLES(ӨЗГӨРМӨЛӨР)
/*
Тексттер ("Салам Дүйнө")
Сандар (10, 2.5)
Чын же Жалган 
 */
void main() {
  // Тексттер үчүн тип
  // String бул тип, a бул өзгөрмөнүн аталышы, "Салам Дүйнө" бул өзгөрмөнүн мааниси, ; бул өзгөрмөнүн бүтүшү.
  String a = "Салам Дүйнө";
  // Бүтүн сандар үчүн тип
  int b = 10;
  // Бөлчөк сандар үчүн тип
  double c = 2.5;
  // Чын же Жалган
  bool d = true;
  // Чын же Жалган
  bool e = false;
  print("Бул жазуу: $a");
  print("Бул жазуу: $b");

  print("Бул жазуу: $c");
  print("Бул жазуу: $d");
  print("Бул жазуу: $e");
}
